In [1]:
import numpy as np
import pandas as pd

In [3]:
sozlukVerisi = {"İstanbul:":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir ": [40,22,44]}

havaDurumu = pd.DataFrame(sozlukVerisi)

In [4]:
havaDurumu

   İstanbul:  Ankara  İzmir
0       30.0    20.0      40
1       29.0     NaN      22
2        NaN    25.0      44

In [5]:
havaDurumu.dropna()# olmayanlları siler

   İstanbul:  Ankara  İzmir
0       30.0    20.0      40

In [6]:
havaDurumu

   İstanbul:  Ankara  İzmir
0       30.0    20.0      40
1       29.0     NaN      22
2        NaN    25.0      44

In [8]:
havaDurumu.dropna(axis=1)  # bütün satırı siliyor amma

   İzmir
0      40
1      22
2      44

In [14]:
sozlukVerisi2 = {"İstanbul:":[30,29,np.nan],"Ankara":[20,np.nan,25],"İzmir ": [40,22,44],"ankara":[49,np.nan,np.nan]}

havaDurumu2 = pd.DataFrame(sozlukVerisi2)

In [15]:
sozlukVerisi2

{'İstanbul:': [30, 29, nan],
 'Ankara': [20, nan, 25],
 'İzmir ': [40, 22, 44],
 'ankara': [49, nan, nan]}

In [17]:
havaDurumu2.dropna(axis=1,thresh=2) #iki tane eksik olanları siler

   İstanbul:  Ankara  İzmir
0       30.0    20.0      40
1       29.0     NaN      22
2        NaN    25.0      44

In [18]:
 havaDurumu2.fillna(20) # eksikleri 20 ile doldur

   İstanbul:  Ankara  İzmir   ankara
0       30.0    20.0      40    49.0
1       29.0    20.0      22    20.0
2       20.0    25.0      44    20.0

In [19]:
##gruplama#

In [30]:
maasSozluk={"deparmanlar":["yazılım","yazılım","ulaşım","ulaşım","satış","satış"],"calisansan isimleri":["ahmet","mehmet","atil","burak","zeynep","fatma"],"maas":[100,22,44,55,66,44]}

In [31]:
maasData= pd.DataFrame(maasSozluk)

In [32]:
maasData

  deparmanlar calisansan isimleri  maas
0     yazılım               ahmet   100
1     yazılım              mehmet    22
2      ulaşım                atil    44
3      ulaşım               burak    55
4       satış              zeynep    66
5       satış               fatma    44

In [36]:
grupobjesi =maasData.groupby("deparmanlar")

In [37]:
grupobjesi.count()

             calisansan isimleri  maas
deparmanlar
satış                          2     2
ulaşım                         2     2
yazılım                        2     2

In [39]:
grupobjesi.mean() #maas ort

             maas
deparmanlar
satış        55.0
ulaşım       49.5
yazılım      61.0

In [40]:
grupobjesi.max()

            calisansan isimleri  maas
deparmanlar
satış                    zeynep    66
ulaşım                    burak    55
yazılım                  mehmet   100

In [41]:
grupobjesi.min()

            calisansan isimleri  maas
deparmanlar
satış                     fatma    44
ulaşım                     atil    44
yazılım                   ahmet    22

In [42]:
grupobjesi.describe()

             maas
            count  mean        std   min    25%   50%    75%    max
deparmanlar
satış         2.0  55.0  15.556349  44.0  49.50  55.0  60.50   66.0
ulaşım        2.0  49.5   7.778175  44.0  46.75  49.5  52.25   55.0
yazılım       2.0  61.0  55.154329  22.0  41.50  61.0  80.50  100.0